Repository: clairvy/perl6-doc-ja
Catalog: perl6-doc-ja-level2.tmx
Source language: en_us
Languages: ja

source: and
ja: と

source: This document originally summarized Apocalypse 1, which covers the initial design concept.
ja: このドキュメントはApocalypse 1を要約したもので、初期のデザインコンセプトを取り上げます。

source: That original summary may be found below under "Random Thoughts".
ja: 原文の概要は "Random Thoughts" 以下にあります。

source: However, these Synopses also contain updates to reflect the evolving design of Perl 6 over time, unlike the Apocalypses, which are frozen in time as "historical documents".
ja: 歴史的資料として凍結されるApocalypsesと違い、SynopsesはPerl 6の設計の更新も反映します 。

source: These updates are not marked--if a Synopsis disagrees with its Apocalypse, assume the Synopsis is correct.
ja: これらの更新点は記録されません ― SynopsisがApocalypseと違う場合はSynopsisが正しいと見なして下さい。

source: Another assumption has been that if we don't talk about something in these Synopses, it's the same as it is in Perl 5.
ja: もう一つの前提として、これらSynopsesで我々が話題にしないことはPerl5と同じです。

source: Soon we plan to fill in the gaps with the Perl 5 details though.
ja: もうすぐ我々はPerl 5の細部とのずれを埋める予定です。

source: Mostly, we're just a bunch of ants all cooperating (sort of) to haul food toward the nest (on average).
ja: 大抵の場合、我々は餌を巣に運ぶアリのような集団に過ぎません。

source: There are many groups of people working on various bits and pieces as they see fit, since this is primarily a volunteer effort.
ja: 主にボランティアによって、多くのグループが適当にこまごまとした仕事を行っています。

source: This document does not attempt to summarize all these subprojects--see the various websites for Parrot and Pugs and Perl 6 for such information.
ja: このドキュメントはこれらのサブプロジェクトを全て要約するわけではありません。そのような情報はParrotやPugsやPerl 6のウェブサイトなどを参照して下さい。

source: What we can say here is that, unlike how it was with Perl 5, none of these projects is designed to be the Official Perl.
ja: 我々が言えることは、Perl 5の場合と違ってこれらのプロジェクトは公式のPerlとは異なるということです。

source: Perl 6 is anything that passes the official test suite.
ja: 公式のテストスイートをパスしたものは全てPerl 6なのです。

source: This test suite was initially developed under the Pugs project because that project is the furthest along in exploring the high-level semantics of Perl 6.
ja: 当初、このテストスイートはPugsプロジェクトの元で開発されました。Perl 6の開発に関してPugsプロジェクトが最も先行していたからです。

source: (Other projects are better at other things, such as speed or interoperability.) However, the Pugs project views the test suite as community property, and is working towards platform neutrality, so that Perl 6 is defined primarily by its desired semantics, not by accidents of history.
ja: (他のプロジェクトは速度や相互運用性などの面では優れています。)しかしPugsプロジェクトはテストスイートをコミュニティの所有物と考えており、プラットフォームに対して中立になることを目指しているので、このテストが動作するものをPerl 6とすることにしました。

source: Another aspect of this is the Perl 6 compiler will be self-hosting.
ja: 他の側面は、Perl 6コンパイラをセルフホスティングすることです。

source: That is, the compiler will eventually compile itself, at least down to the point where various code-generating backends can take over.
ja: 様々なコード出力バックエンドが開発されたら、最終的にはコンパイラ自身をコンパイルするようにします。

source: This largely removes platform dependencies from the frontend, so that only the backends need to worry about platform-specific issues.
ja: これは主にフロントエンドからプラットフォームの依存性を取り除き、バックエンドだけがプラットフォーム固有の問題を気にするようになります。

source: The word "apocalypse" historically meant merely "a revealing", and we're using it in that unexciting sense.
ja: "apocalypse" という言葉は歴史的には啓示することを意味します。我々はそのありきたりな意味で使っています。

source: If you ask for RFCs from the general public, you get a lot of interesting but contradictory ideas, because people tend to stake out polar positions, and none of the ideas can build on each other.
ja: もしあなたがRFCを一般人に尋ねたら、興味深いが矛盾した多くのアイデアを得るでしょう。人々の意見は極端に分かれがちで、どのアイデアもお互いに構築することが出来ません。

source: Larry's First Law of Language Redesign: Everyone wants the colon.
ja: Larryによる新しい言語設計の最初の秩序：みんながcolonを望む。

source: This document summarizes Apocalypse 2, which covers small-scale lexical items and typological issues.
ja: このドキュメントはApocalypse 2の要約で、小規模の字句項目と類型的問題を取り上げます。

source: (These Synopses also contain updates to reflect the evolving design of Perl 6 over time, unlike the Apocalypses, which are frozen in time as "historical documents".
ja: (Apocalypsesと違い、これらのSynopsesは時間と共に進化するPerl 6のデザインの更新を反映します。 Apocalypsesは歴史的資料としてある時点で凍結されています。

source: These updates are not marked--if a Synopsis disagrees with its Apocalypse, assume the Synopsis is correct.)
ja: これらの更新は記録されません―SynopsisがApocalypseと異なるなら、Synopsisが正しいと見なして下さい。)

source: To the extent allowed by sublanguages' parsers, Perl is parsed using a one-pass, predictive parser.
ja: サブ言語のパーサーによる拡張のために、Perlはワンパスの予測的パーサーによって解析されます。

source: That is, lookahead of more than one "longest token" is discouraged.
ja: つまり、複数の最長トークンの先読みは推奨されません。

source: The currently known exceptions to this are where the parser must:
ja: これについて現在知られている例外は、パーサーが以下のようにしなければならない場合です:

source: Locate the end of interpolated expressions that begin with a sigil and might or might not end with brackets.
ja: sigilで始まり、ブロックで終わる、または終わらないかもしれない展開式の終了位置を決定する

source: Recognize that a reduce operator is not really beginning a [...] composer.
ja: 減少演算子が[...]の生成を開始するとは限らないと認識する

source: In the abstract, Perl is written in Unicode, and has consistent Unicode semantics regardless of the underlying text representations.
ja: 理論上はPerlはユニコードで記述され、基本的なテキスト表現に関係なく一貫したユニコードのセマンティクス(意味)を持っています。

source: By default Perl presents Unicode in "NFG" formation, where each grapheme counts as one character.
ja: それぞれの書記素が1文字として数えられる場所では、PerlはデフォルトでユニコードをNFG形式で表現します。

source: A grapheme is what the novice user would think of as a character in their normal everyday life, including any diacritics.
ja: 書記素とは初心者ユーザーが日常生活の中で考えると思われるあらゆる発音記号を含みます。

source: Perl can count Unicode line and paragraph separators as line markers, but that behavior had better be configurable so that Perl's idea of line numbers matches what your editor thinks about Unicode lines.
ja: Perlはユニコードの行とパラグラフのセパレータを行マーカーとして数えることが出来ます。しかし、その振る舞いはあなたのエディタが考えるユニコードの行とPerlの行番号の考え方がマッチするように設定出来るべきです。

source: Unicode horizontal whitespace is counted as whitespace, but it's better not to use thin spaces where they will make adjoining tokens look like a single token.
ja: ユニコードの水平空白は空白として数えられます。しかし、単独のトークンに見えるような隣接したトークンを生成するような場所ではem幅の空白は使わないべきです。

source: On the other hand, Perl doesn't use indentation as syntax, so you are free to use any amount of whitespace anywhere that whitespace makes sense.
ja: 一方でPerlはインデントを文法として使わないので、空白が意味をなす場所ではいくらでも自由に空白を使うことが出来ます。

source: Comments always count as whitespace.
ja: コメントは常に空白として数えられます。

source: For some syntactic purposes, Perl distinguishes bracketing characters from non-bracketing.
ja: いくつかの構文上の目的で、Perlは括弧でないものから括弧文字を識別します。

source: Bracketing characters are defined as any Unicode characters with either bidirectional mirrorings or Ps/Pe/Pi/Pf properties.
ja: 括弧文字は双方向対称かPs/Pe/Pi/Pfプロパティのどちらかのユニコード文字として定義されます。

source: In practice, though, you're safest using matching characters with Ps/Pe/Pi/Pf properties, though ASCII angle brackets are a notable exception, since they're bidirectional but not in the Ps/Pe/Pi/Pf sets.
ja: 実用上はPs/Pe/Pi/Pfプロパティの文字を使うのが最も安全ですが、ASCIIの不等号括弧はPs/Pe/Pi/Pfセットではないのに双方向なので注目すべき例外です。

source: Characters with no corresponding closing character do not qualify as opening brackets.
ja: 対応する閉じ文字がない文字は括弧の開始と見なされません。

source: This includes the second section of the Unicode BidiMirroring data table.
ja: これはユニコードBidiMirroringデータテーブルの第2セクションを含みます。

source: If a character is already used in Ps/Pe/Pi/Pf mappings, then any entry in BidiMirroring is ignored (both forward and backward mappings).
ja: 文字が既にPs/Pe/Pi/Pfマッピングで使用されている場合、どのBidiMirroringのエントリも無視されます（前方、後方マッピング両方）。

source: For any given Ps character, the next Pe codepoint (in numerical order) is assumed to be its matching character even if that is not what you might guess using left-right symmetry.
ja: 任意のPs文字に対して次のPeコードポイント(番号順)は、たとえあなたが左右対称だと思っていなくてもマッチする文字と見なされます。

source: Therefore U+298D maps to U+298E, not U+2990, and U+298F maps to U+2990, not U+298E.
ja: 従ってU+298DはU+2990ではなくU+298Eにマップされ、U+298FはU+298EではなくU+2990にマップされます。

source: Neither U+298E nor U+2990 are valid bracket openers, despite having reverse mappings in the BidiMirroring table.
ja: U+298EとU+2990はどちらも括弧の開始ではありません。にもかかわらずBidiMirroringテーブルに逆のマッピングを持っています。

source: The U+301D codepoint has two closing alternatives, U+301E and U+301F; Perl 6 only recognizes the one with lower code point number, U+301E, as the closing brace.
ja: U+301Dコードポイントは2つの代替の終了文字を持っています。U+301EとU+301Fです。Perl 6は低いコードポイント数のU+301Eだけを閉じブレースとして認識します。

source: This policy also applies to new one-to-many mappings introduced in the future.
ja: このポリシーは未来に登場する新しい1対多のマッピングにも適用します。

source: However, many-to-one mappings are fine; multiple opening characters may map to the same closing character.
ja: しかしながら、多対1は構いません。複数の開始文字は同じ終了文字にマップするでしょう。

source: For instance, U+2018, U+201A, and U+201B may all be used as the opener for the U+2019 closer.
ja: 例えばU+2018、U+201A、U+201Bは全てU+2019クローザーに対するオープナーとして使われるでしょう。

source: Constructs that count openers and closers assume that only the given opener is special.
ja: オープナーとクローザーを考慮する構造は、与えられたオープナーだけが特別と見なします。

source: That is, if you open with one of the alternatives, all other alternatives are treated as non-bracketing characters within that construct.
ja: つまり代替文字の1つで開く場合、他の代替文字はその構造では非括弧文字として扱われます。

source: POD sections may be used reliably as multiline comments in Perl 6.
ja: Perl 6ではPODセクションは複数行コメントとして確実に使用されるようになるでしょう。

source: Unlike in Perl 5, POD syntax now lets you use =begin comment and =end comment delimit a POD block correctly without the need for =cut.
ja: Perl 5と違い、現在のPOD構文は=begin commentと=end commentを=cut無しでPODブロックを正しく区切って使えるようにします。

source: (In fact, =cut is now gone.) The format name does not have to be comment -- any unrecognized format name will do to make it a comment.
ja: (現に、=cutは無くなりました。)フォーマット名は commentである必要はありません。識別されないフォーマット名はコメントになるでしょう。

source: (However, bare =begin and =end probably aren't good enough, because all comments in them will show up in the formatted output.)
ja: (しかし、裸の=beginと=endではおそらく不十分です。その中の全てのコメントがフォーマットされて表示されてしまうからです。)

source: We have single paragraph comments with =for comment as well.
ja: さらに、単独のパラグラフコメント=for commentがあります。

source: That lets =for keep its meaning as the equivalent of a =begin and =end combined.
ja: これは=forを=beginと=endが結合したものと同等の意味を持つようにさせます。

source: As with =begin and =end, a comment started in code reverts to code afterwards.
ja: =beginと=endのように、コメントはコードの前から後まで続きます。

source: Since there is a newline before the first =, the POD form of comment counts as whitespace equivalent to a newline.
ja: 最初の=の前に改行が現れるまで、POD形式のコメントは改行と同様に空白としてカウントします。

source: See S26 for more on embedded documentation.
ja: 埋め込みドキュメントの詳細はS26を見て下さい。

source: Except within a string literal, a # character always introduces a comment in Perl 6.
ja: Perl 6では文字列リテラルを除いて、#は常にコメントになります。

source: There are two forms of comment based on #.
ja: #を元にしたコメントは2つの形式があります。

source: Embedded comments require the # to be followed by one or more opening bracketing characters.
ja: 埋め込みコメントは1つかそれ以上の括弧の開始文字が続く#を必要とします。

source: All other uses of # are interpreted as single-line comments that work just as in Perl 5, starting with a # character and ending at the subsequent newline.
ja: その他の#の使用はPerl 5のように1行コメントとして解釈され、#で始まって次の改行で終わります。

source: They count as whitespace equivalent to newline for purposes of separation.
ja: それは分割を目的とした改行と同じく空白とみなされます。

source: Unlike in Perl 5, # may not be used as the delimiter in quoting constructs.
ja: Perl 5と違い、#はクォートを構築する区切り文字としては使用されません。

source: Embedded comments are supported as a variant on quoting syntax, introduced by # plus any user-selected bracket characters (as defined in Lexical Conventions above):
ja: 埋め込みコメントはクォーティング構文の変化形としてサポートされ、#とユーザーが選んだ括弧文字(Lexical Conventionsで定義されているもの)で導入されます:

source: Brackets may be nested, following the same policy as ordinary quote brackets.
ja: 括弧は普通の引用括弧と同じポリシーに沿ってネストするでしょう。

source: There must be no space between the # and the opening bracket character.
ja: 括弧の開始文字と#の間に空白を置くことは出来ません。

source: (There may be the visual appearance of space for some double-wide characters, however, such as the corner quotes above.)
ja: (上記のかぎ括弧のように見栄えのあるダブルワイド文字がいくつかあります。)

source: An embedded comment is not allowed as the first thing on the line.
ja: 行頭に埋め込みコメントを置くことはできません。

source: If you wish to have a comment there, you must disambiguate it to either an embedded comment or a line-end comment.
ja: もしそこにコメントを置きたいなら、埋め込みコメントか行コメントの曖昧さをなくす必要があります。

source: You can put a space in front of it to make it an embedded comment:
ja: 埋め込みコメントにするために、前に空白を置くことが出来ます:

source: Or you can put something other than a single # to make it a line-end comment.
ja: または行コメントにするために単一の#以外のものを置くことが出来ます。

source: Therefore, if you are commenting out a block of code using the line-comment form, we recommend that you use ##, or # followed by some whitespace, preferably a tab to keep any tab formatting consistent:
ja: 従って、もしコードブロックを行コメントを使ってコメントアウトするなら、空白(タブによるフォーマッティングを一貫するならタブが好ましい)が続く##か#を使うことをお勧めします:

source: However, it's often better to use pod comments because they are implicitly line-oriented.
ja: しかしながら、PODコメントは暗黙の行指向なのでそちらの方が良い場合もあります。

source: And if you have an intelligent syntax highlighter that will mark pod comments in a different color, there's less visual need for a # on every line.
ja: それに、もしあなたがPODコメントを色分けする賢いシンタックスハイライターを持っているなら、それぞれの#の行に必要なビジュアルが少なくなってしまいます。

source: For all quoting constructs that use user-selected brackets, you can open with multiple identical bracket characters, which must be closed by the same number of closing brackets.
ja: ユーザーが選んだ括弧のクォート構文で、複数の一致する括弧文字を使うことが出来ます。閉じ括弧は同じ数でなければなりません。

source: Counting of nested brackets applies only to pairs of brackets of the same length as the opening brackets:
ja: 括弧のネストは開き括弧と同じ数でなければ適用されません。

source: Note however that bare circumfix or postcircumfix <<...>> is not a user-selected bracket, but the ASCII variant of the «...» interpolating word list.
ja: しかし注意として、裸の接周辞または後置接周辞<<...>>はユーザー選択の括弧ではなく、«...»のワードリストを展開したASCII形式の別記法です。

source: Only # and the q-style quoters (including m, s, tr, and rx) enable subsequent user-selected brackets.
ja: #とqスタイルのクォート(m、s、 tr、rxを含む)だけが後に続くユーザー選択の括弧を使用できます。

source: Some languages such as C allow you to escape newline characters to combine lines.
ja: C言語のようないくつかの言語は、行を結合するために改行をエスケープすることを認めています。

source: Other languages (such as regexes) allow you to backslash a space character for various reasons.
ja: 他の言語(正規表現など)は空白文字のバックスラッシュを様々な理由で認めています。

source: Perl 6 generalizes this notion to any kind of whitespace.
ja: Perl 6はこの概念をあらゆる種類の空白に一般化します。

source: Any contiguous whitespace (including comments) may be hidden from the parser by prefixing it with \.
ja: あらゆる連続する空白(コメント含む)は\を前置することによってパーサーから隠蔽されます。

source: This is known as the "unspace".
ja: これはunspaceとして知られています。

source: An unspace can suppress any of several whitespace dependencies in Perl.
ja: unspaceはPerlの様々な空白のいずれかの依存関係を隠することが出来ます。

source: For example, since Perl requires an absence of whitespace between a noun and a postfix operator, using unspace lets you line up postfix operators:
ja: 例えばPerlは名詞と後置演算子の間に空白が無いことを要求するので、unspaceを使うことで後置演算子を繋げることが出来ます:

source: As a special case to support the use above, a backslash where a postfix is expected is considered a degenerate form of unspace.
ja: 上記の使い方をサポートするための特別な場合として、後置演算子が期待される場所でのバックスラッシュはunspaceの変質した形式と見なされます。

source: Note that whitespace is not allowed before that, hence
ja: 注意として、それの前に空白は置けません。そのため

source: is a syntax error (two terms in a row).
ja: は構文エラーです(行に2つの項)。

source: And
ja: そして

source: will be parsed as a list operator with a Capture argument:
ja: はCapture引数を伴うリスト演算子と解析されます:

source: However, other forms of unspace may usefully be preceded by whitespace.
ja: しかし、他の形式のunspaceは空白の前にきて役に立ちます。

source: (Unary uses of backslash may therefore never be followed by whitespace or they would be taken as an unspace.)
ja: (それ故に単項のバックスラッシュの使われ方は空白が続かないこと、または空白をunspaceと受け取ることです。)

source: Other postfix operators may also make use of unspace:
ja: 他の後置演算子もunspaceを活用できます:

source: Another normal use of a you-don't-see-this-space is typically to put a dotted postfix on the next line:
ja: もう一つ見えない空白の使い方は、典型的にはドット後置演算子を次の行に置くことです:

source: But unspace is mainly about language extensibility: it lets you continue the line in any situation where a newline might confuse the parser, regardless of your currently installed parser.
ja: しかしunspaceは主に言語の拡張性に関するものです。あなたが現在インストールしているパーサーに関わらず、改行がパーサーを混乱させるかもしれないあらゆる場面で行を継続させます。

source: (Unless, of course, you override the unspace rule itself...)
ja: (もちろん、あなたがunspaceのルール自体を上書きすれば別ですが・・・)

source: Although we say that the unspace hides the whitespace from the parser, it does not hide whitespace from the lexer.
ja: とは言え、unspaceはパーサーから空白を隠しますが、レクサーからは隠しません。

source: As a result, unspace is not allowed within a token.
ja: その結果として、unspaceはトークンとして認められません。

source: Additionally, line numbers are still counted if the unspace contains one or more newlines.
ja: 加えて、unspaceが1つ以上の改行を含むなら依然として行番号がカウントされます。

source: A # following such a newline is always an end-of-line comment, as described above.
ja: そのような改行に続く#は上に述べたように常に行コメントです。

source: Since Pod chunks count as whitespace to the language, they are also swallowed up by unspace.
ja: Podチャンク(かたまり)は言語にとって空白として数えられるので、それもunspaceによって取り込むことが出来ます。

source: Heredoc boundaries are suppressed, however, so you can split excessively long heredoc intro lines like this:
ja: ヒアドキュメントの境界は隠蔽されます。けれども、あなたは過度に長いヒアドキュメントの出だしの行をこのように分割できます:

source: To the heredoc parser that just looks like:
ja: ヒアドキュメントのパーサーは単にこのように見ます:

source: Note that this is one of those cases in which it is fine to have whitespace before the unspace, since we're only trying to suppress the newline transition, not all whitespace as in the case of postfix parsing.
ja: 注意として、これはunspaceの前に空白を置いても構わないケースの1つです。なので接尾辞の解析については我々は全ての空白ではなく改行の変わり目を隠そうと試みているだけです。

source: (Note also that the example above is not meant to spec how the test suite works.
ja: (さらに注意として、上記の例はテストスイートの動作仕様を意図していません。

source: An unspace may contain a comment, but a comment may not contain an unspace.
ja: unspaceはコメントを含むかもしれませんが、コメントはunspaceを含みません。

source: In particular, end-of-line comments do not treat backslash as significant.
ja: 特に、行コメントはバックスラッシュを意味のあるものとして扱いません。

source: If you say:
ja: もしあなたが次のようにするなら:

source: it is an end-of-line comment, not an embedded comment.
ja: 埋め込みコメントではなく行コメントです。

source: Write:
ja: 次のように書くと:

source: to mean the other thing.
ja: 他のことを意味します。

source: In general, whitespace is optional in Perl 6 except where it is needed to separate constructs that would be misconstrued as a single token or other syntactic unit.
ja: 一般に、単独のトークンか他の構文上の単位と間違って解釈される構成を分離する必要がある場所を除いて、Perl 6での空白は任意です。

source: (In other words, Perl 6 follows the standard longest-token principle, or in the cases of large constructs, a prefer shifting to reducing principle.
ja: (言い換えれば、Perl 6は標準の最長トークンの原則、または大きな構文の場合はprefer shifting to reducingの原則に従います。

source: See Grammatical Categories below for more on how a Perl program is analyzed into tokens.)
ja: Perlプログラムがどのようにトークンに解析されるか、詳細についてはGrammatical Categoriesを参照して下さい。)

source: This is an unchanging deep rule, but the surface ramifications of it change as various operators and macros are added to or removed from the language, which we expect to happen because Perl 6 is designed to be a mutable language.
ja: これは不変の深いルールです。しかしPerl 6は可変の言語となるように設計されているので、様々な演算子や言語にマクロを追加したり削除することで表面上の悪影響を変えるということが起こるのを我々は期待しています。

source: In particular, there is a natural conflict between postfix operators and infix operators, either of which may occur after a term.
ja: 特に、項の後で後置演算子と2項演算子の間の自然な競合がどちらかで起こります。

source: If a given token may be interpreted as either a postfix operator or an infix operator, the infix operator requires space before it.
ja: もし与えられたトークンが後置演算子か2項演算子と解釈されそうなら、2項演算子の前に空白が必要です。

source: Postfix operators may never have intervening space, though they may have an intervening dot.
ja: 後置演算子は間に入る空白を持ちませんが、間に入るドットを持つことがあります。

source: If further separation is desired, an unspace or embedded comment may be used as described above, as long as no whitespace occurs outside the unspace or embedded comment.
ja: その上で分離が望まれるなら、空白がunspaceか埋め込みコメントの外側に発生しない限り前述のunspaceか埋め込みコメントが使われるでしょう。

source: For instance, if you were to add your own infix:<++> operator, then it must have space before it.
ja: 例えばあなたのinfix:<++>という2項演算子を追加するとしたら、その前に必ず空白が必要です。

source: The normal autoincrementing postfix:<++> operator may never have space before it, but may be written in any of these forms:
ja: 標準の自動インクリメントpostfix:<++>演算子はその前に空白を持ちませんが、これらの形式のどれかで書かれます:

source: A consequence of the postfix rule is that (except when delimiting a quote or terminating an unspace) a dot with whitespace in front of it is always considered a method call on $_ where a term is expected.
ja: (クォートを区切るかunspaceを終了することは除いて)項が期待される場所で前に空白があるドットは常に$_のメソッド呼び出しとみなされます。 それが接尾辞のルールの結果です。

source: If a term is not expected at this point, it is a syntax error.
ja: その箇所で項が期待されていないなら、それは構文エラーです。

source: (Unless, of course, there is an infix operator of that name beginning with dot.
ja: (もちろんドットで始まる名前の2項演算子があるなら別ですが。)

source: You could, for instance, define a Fortranly infix:<.EQ.> if the fit took you.
ja: 例えば、その気になればFortran風のinfix:<.EQ.>を定義することもできます。

source: But you'll have to be sure to always put whitespace in front of it, or it would be interpreted as a postfix method call instead.)
ja: しかしあなたはそれの前に常に空白を置くか、代わりに後置メソッド呼び出しと解釈されるようにして気をつけなければなりません。)

source: For example,
ja: 例えば、

source: will always be interpreted as
ja: は常に次のように解釈されるでしょう。

source: but never as
ja: 以下のようにはなりません。

source: Use some variant of
ja: 以下のいくつかの変化形を使って下さい。

source: if you mean the postfix method call.
ja: もし後置のメソッド呼び出しを意味するなら。

source: One consequence of all this is that you may no longer write a Num as 42. with just a trailing dot.
ja: これら全ての内の1つの結果として、ただの終端ドットを伴うNumを 42.として書くことはもはやできません。

source: You must instead say either 42 or 42.0.
ja: 代わりにあなたは42か42.0のどちらかにしなければなりません。

source: In other words, a dot following a number can only be a decimal point if the following character is a digit.
ja: 言い換えれば、もし直後の文字が数字なら、数の直後のドットは小数点にしかなり得ません。

source: Otherwise the postfix dot will be taken to be the start of some kind of method call syntax.
ja: そうでなければ、後置のドットはいくつかの種類のメソッド呼び出し構文の開始と取られるでしょう。

source: (The .123 form with a leading dot is still allowed however when a term is expected, and is equivalent to 0.123 rather than $_.123.)
ja: (項が期待される場合でも、直前のドットを伴う.123形式がまだ認められています。そしてそれは$_.123ではなく0.123と同じです。)

source: In support of OO encapsulation, there is a new fundamental datatype: P6opaque.
ja: オブジェクト指向カプセル化のサポートの中で、新しい基本データ型があります: P6opaqueです。

source: External access to opaque objects is always through method calls, even for attributes.
ja: opaqueオブジェクトへの外部からのアクセスは常にメソッド呼び出しを通して行われます。属性でさえそうです。

source: Perl 6 has an optional type system that helps you write safer code that performs better.
ja: Perl 6はより安全でより良く動作するコードを書くことを助ける選択自由な型システムを持っています。

source: The compiler is free to infer what type information it can from the types you supply, but will not complain about missing type information unless you ask it to.
ja: コンパイラがあなたの提供可能な型情報を推測するのは自由です。しかしあなたが尋ねない限り、欠落した型情報について文句を言いません。

source: Types are officially compared using name equivalence rather than structural equivalence.
ja: 型は構造的な等価性よりも名前の等価性で正式に比較されます。

source: However, we're rather liberal in what we consider a name.
ja: しかし、我々は名前を考えることに寛大であることを好みます。

source: For example, the name includes the version and authority associated with the module defining the type (even if the type itself is "anonymous").
ja: 例えば、名前は型を定義するモジュールに関連付けられたバージョンと権限を含みます(たとえ型自体が無名でも)。

source: Beyond that, when you instantiate a parametric type, the arguments are considered part of the "long name" of the resulting type, so one Array of Int is equivalent to another Array of Int.
ja: その上でパラメータを伴う型をインスタンス化する場合、引数は結果となる型の長い名前の一部と考えられるので、あるArray of Intは他のArray of Intと同等です。
